gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c

/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file    App/app_zigbee.c
  * @author  MCD Application Team
  * @brief   Zigbee Application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_common.h"
#include "app_entry.h"
#include "dbg_trace.h"
#include "app_zigbee.h"
#include "zigbee_interface.h"
#include "shci.h"
#include "stm_logging.h"
#include "app_conf.h"
#include "stm32wbxx_core_interface_def.h"
#include "zigbee_types.h"
#include "cmsis_os.h"

/* Private includes -----------------------------------------------------------*/
#include <assert.h>
#include "zcl/zcl.h"
#include "zcl/general/zcl.onoff.h"
#include "zcl/general/zcl.identify.h"

/* USER CODE BEGIN Includes */
#include "ee.h"
#include "hw_flash.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
/* USER CODE END PTD */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500U

//VST_COMMENT: we should probably move all our private defines into the related code section (even though the code is not generated by CubeMX)
#define SW1_ENDPOINT                                17

#define APP_ZIGBEE_TOUCHLINK_ENDPOINT              200
#define APP_ZIGBEE_TOUCHLINK_MIN_RSSI              -60
#define APP_ZIGBEE_TOUCHLINK_TARGET                  0
/* A subset of WPAN_CHANNELMASK_2400MHZ_HA (HA preferred channels) */
#define APP_ZIGBEE_CHANNELMASK_2400MHZ_TCLK_PRIMARY  0x02108800 /* Channels 11, 15, 20, 25*/

/*For debug we isolate only 1 channel */
#define APP_ZIGBEE_DEBUG_TOUCHLINK                   0
#if (APP_ZIGBEE_DEBUG_TOUCHLINK == 1)
#define APP_ZIGBEE_TOUCHLINK_CHANNEL                15u
#define APP_ZIGBEE_TOUCHLINK_CHANNEL_MASK           ( 1u << APP_ZB_TOUCHLINK_CHANNEL )
#else
#define APP_ZIGBEE_TOUCHLINK_CHANNEL_MASK           APP_ZIGBEE_CHANNELMASK_2400MHZ_TCLK_PRIMARY
#endif
/* USER CODE BEGIN PD */
#define SW1_GROUP_ADDR                              0x0001
#define CFG_NVM                                      1U /* use FLASH */
#define APP_ZIGBEE_NETWORK_JOIN_MAX_RETRY           10U
/* USER CODE END PD */

/* Private macros ------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */

/* External definition -------------------------------------------------------*/
enum ZbStatusCodeT ZbStartupWait(struct ZigBeeT *zb, struct ZbStartupT *config);

/* USER CODE BEGIN ED */
/* USER CODE END ED */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_StackLayersInit(void);
static void APP_ZIGBEE_ConfigEndpoints(void);
static void APP_ZIGBEE_NwkForm(void);

static void APP_ZIGBEE_TraceError(const char *pMess, uint32_t ErrCode);
static void APP_ZIGBEE_CheckWirelessFirmwareInfo(void);

static void Wait_Getting_Ack_From_M0(void);
static void Receive_Ack_From_M0(void);
static void Receive_Notification_From_M0(void);

static void APP_ZIGBEE_ProcessNotifyM0ToM4(void * argument);
static void APP_ZIGBEE_ProcessRequestM0ToM4(void * argument);
static void APP_ZIGBEE_ProcessNwkForm(void * argument);

/* USER CODE BEGIN PFP */
static void APP_ZIGBEE_ConfigGroupAddr(void);
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT *zb);
static void APP_ZIGBEE_persist_notify_cb(struct ZigBeeT *zb, void *cbarg);
static void APP_ZIGBEE_PersistCompleted_callback(enum ZbStatusCodeT status,void *arg);
static bool APP_ZIGBEE_persist_save(void);
static bool APP_ZIGBEE_persist_load(void);
static enum ZclStatusCodeT APP_ZIGBEE_RestoreClusterAttr(struct ZbZclClusterT *clusterPtr);
#ifdef CFG_NVM
static void APP_ZIGBEE_NVM_Init(void);
static bool APP_ZIGBEE_NVM_Read(void);
static bool APP_ZIGBEE_NVM_Write(void);
static void APP_ZIGBEE_NVM_Erase(void);
#endif /* CFG_NVM */

static void APP_ZIGBEE_ProcessPushButton(void *argument);
static void APP_ZIGBEE_SW1_Process(void);
static void APP_ZIGBEE_SW2_Process(void);
void APP_ZIGBEE_LaunchPushButtonTask(uint32_t buttonFlag);
void APP_ZIGBEE_LaunchPushButton3ShortPressTask(void);
void APP_ZIGBEE_LaunchPushButton3LongPressTask(void);
/* OTA application related functions */

extern void APP_ZIGBEE_OTA_Client_Init(void);
extern void APP_ZIGBEE_OTA_ConfigEndpoints(void);
extern void APP_ZIGBEE_OTA_ThreadsInit(void);

/* Light bulb application related functions */

extern void APP_ZIGBEE_LightBulb_ConfigEndpoints(void);
/* USER CODE END PFP */

/* Private variables ---------------------------------------------------------*/
static TL_CmdPacket_t   *p_ZIGBEE_otcmdbuffer;
static TL_EvtPacket_t   *p_ZIGBEE_notif_M0_to_M4;
static TL_EvtPacket_t   *p_ZIGBEE_request_M0_to_M4;
static __IO uint32_t    CptReceiveNotifyFromM0 = 0;
static __IO uint32_t    CptReceiveRequestFromM0 = 0;

static osThreadId_t   OsTaskNotifyM0ToM4Id;
static osThreadId_t   OsTaskRequestM0ToM4Id;
static osThreadId_t   OsTaskNwkFormId;
static osThreadId_t   OsTaskPushButtonId;
static osMutexId_t    MtxZigbeeId;

osSemaphoreId_t       TransferToM0Semaphore;
osSemaphoreId_t       StartupEndSemaphore;

PLACE_IN_SECTION("MB_MEM1") ALIGN(4) static TL_ZIGBEE_Config_t ZigbeeConfigBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static TL_CmdPacket_t ZigbeeOtCmdBuffer;
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRspEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];
PLACE_IN_SECTION("MB_MEM2") ALIGN(4) static uint8_t ZigbeeNotifRequestBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255U];

