gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
static struct zigbee_app_info zigbee_app_info;

/* FreeRtos stacks attributes */
const osThreadAttr_t TaskNotifyM0ToM4_attr =
{
    .name = CFG_TASK_NOTIFY_M0_TO_M4_PROCESS_NAME,
    .attr_bits = CFG_TASK_PROCESS_ATTR_BITS,
    .cb_mem = CFG_TASK_PROCESS_CB_MEM,
    .cb_size = CFG_TASK_PROCESS_CB_SIZE,
    .stack_mem = CFG_TASK_PROCESS_STACK_MEM,
    //VST_COMMENT: was that really necessary to increase the task priority? (BelowNormal => AboveNormal)
    .priority = osPriorityAboveNormal,
    .stack_size = CFG_TASK_PROCESS_STACK_SIZE
};

const osThreadAttr_t TaskRequestM0ToM4_attr =
{
    .name = CFG_TASK_REQUEST_M0_TO_M4_PROCESS_NAME,
    .attr_bits = CFG_TASK_PROCESS_ATTR_BITS,
    .cb_mem = CFG_TASK_PROCESS_CB_MEM,
    .cb_size = CFG_TASK_PROCESS_CB_SIZE,
    .stack_mem = CFG_TASK_PROCESS_STACK_MEM,
    //VST_COMMENT: was that really necessary to increase the task priority? (BelowNormal => AboveNormal)
    .priority = osPriorityAboveNormal,
    .stack_size = CFG_TASK_PROCESS_STACK_SIZE
};

const osThreadAttr_t TaskNwkForm_attr =
{
    .name = CFG_TASK_NWK_FORM_PROCESS_NAME,
    .attr_bits = CFG_TASK_PROCESS_ATTR_BITS,
    .cb_mem = CFG_TASK_PROCESS_CB_MEM,
    .cb_size = CFG_TASK_PROCESS_CB_SIZE,
    .stack_mem = CFG_TASK_PROCESS_STACK_MEM,
    //VST_COMMENT: was that really necessary to increase the task priority? (BelowNormal => AboveNormal)
    .priority = osPriorityBelowNormal,
    .stack_size = CFG_TASK_PROCESS_STACK_SIZE
};

const osThreadAttr_t TaskPushButton_attr =
{
    .name = CFG_TASK_PUSH_BUTTON_PROCESS_NAME,
    .attr_bits = CFG_TASK_PROCESS_ATTR_BITS,
    .cb_mem = CFG_TASK_PROCESS_CB_MEM,
    .cb_size = CFG_TASK_PROCESS_CB_SIZE,
    .stack_mem = CFG_TASK_PROCESS_STACK_MEM,
    .priority = osPriorityAboveNormal,
    .stack_size = CFG_TASK_PROCESS_STACK_SIZE
};

/* USER CODE BEGIN PV */
/* ZLL Master Key*/
const uint8_t sec_key_touchlink_master[ZB_SEC_KEYSIZE] = {
    0x9F, 0x55, 0x95, 0xF1, 0x02, 0x57, 0xC8, 0xA4,
    0x69, 0xCB, 0xF4, 0x2B, 0xC9, 0x3F, 0xEE, 0x31
};

/* NVM variables */
/* cache in uninit RAM to store/retrieve persistent data */
union cache
{
  uint8_t  U8_data[ST_PERSIST_MAX_ALLOC_SZ];     // in bytes
  uint32_t U32_data[ST_PERSIST_MAX_ALLOC_SZ/4U]; // in U32 words
};
__attribute__ ((section(".noinit"))) union cache cache_persistent_data;

__attribute__ ((section(".noinit"))) union cache cache_diag_reference;

/* USER CODE END PV */
/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Zigbee application initialization
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_Init(void)
{
  SHCI_CmdStatus_t ZigbeeInitStatus;

  APP_DBG("APP_ZIGBEE_Init");

  /* Check the compatibility with the Coprocessor Wireless Firmware loaded */
  APP_ZIGBEE_CheckWirelessFirmwareInfo();

  /* Register cmdbuffer */
  APP_ZIGBEE_RegisterCmdBuffer(&ZigbeeOtCmdBuffer);

  /* Init config buffer and call TL_ZIGBEE_Init */
  APP_ZIGBEE_TL_INIT();

  /* NVM Init */
#if CFG_NVM
  APP_ZIGBEE_NVM_Init();
#endif

  /* Initialize the mutex */
  MtxZigbeeId = osMutexNew( NULL );

  /* Initialize the semaphores */
  StartupEndSemaphore = osSemaphoreNew( 1, 0, NULL ); /*< Create the semaphore and make it busy at initialization */
  TransferToM0Semaphore = osSemaphoreNew( 1, 0, NULL );

  /* Register task */
  /* Create the different tasks */
  OsTaskNotifyM0ToM4Id = osThreadNew(APP_ZIGBEE_ProcessNotifyM0ToM4, NULL,&TaskNotifyM0ToM4_attr);
  OsTaskRequestM0ToM4Id = osThreadNew(APP_ZIGBEE_ProcessRequestM0ToM4, NULL,&TaskRequestM0ToM4_attr);

  /* Task associated with push button SW1 */
  OsTaskPushButtonId = osThreadNew(APP_ZIGBEE_ProcessPushButton, NULL,&TaskPushButton_attr);

  /* Task associated with network creation process */
  OsTaskNwkFormId = osThreadNew(APP_ZIGBEE_ProcessNwkForm, NULL,&TaskNwkForm_attr);

  /* USER CODE BEGIN APP_ZIGBEE_INIT */
#ifdef OTA_SUPPORT
  APP_ZIGBEE_OTA_ThreadsInit();
#endif
  /* USER CODE END APP_ZIGBEE_INIT */
  
  /* Start the Zigbee on the CPU2 side */
  ZigbeeInitStatus = SHCI_C2_ZIGBEE_Init();
  /* Prevent unused argument(s) compilation warning */
  UNUSED(ZigbeeInitStatus);

  /* Initialize Zigbee stack layers */
  APP_ZIGBEE_StackLayersInit();

}

/**
 * @brief  Initialize Zigbee stack layers
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_StackLayersInit(void)
{
  APP_DBG("APP_ZIGBEE_StackLayersInit");
  enum ZbStatusCodeT status = ZB_STATUS_SUCCESS;

  zigbee_app_info.zb = ZbInit(0U, NULL, NULL);
  assert(zigbee_app_info.zb != NULL);

  /* Stack config */
  //VST_COMMENT: ingoring LQI is just a workaround for demo to improve the performance in noisy environment
  /* Enhance range by ignoring LQI cost during join */
  enum ZbStatusCodeT status;
  uint32_t val32 = ZB_BDB_FLAG_IGNORE_COST_DURING_JOIN;
  status = ZbBdbSet(zigbee_app_info.zb, ZB_BDB_Flags, &val32, sizeof(val32));
  UNUSED(status);
  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit */
  BSP_LED_Off(LED_RED);
  BSP_LED_Off(LED_GREEN);
  BSP_LED_Off(LED_BLUE);
  /* USER CODE END APP_ZIGBEE_StackLayersInit */

  /* Configure the joining parameters */
  zigbee_app_info.join_status = (enum ZbStatusCodeT) 0x01; /* init to error status */
  zigbee_app_info.join_delay = HAL_GetTick(); /* now */
  zigbee_app_info.startupControl = ZbStartTypeJoin; //ZbStartTypeForm;

  /* Initialization Complete */
  zigbee_app_info.has_init = true;
  /* Define if we need to do a fresh start */
  zigbee_app_info.fresh_startup = true;

  /* First we disable the persistent notification */
  ZbPersistNotifyRegister(zigbee_app_info.zb,NULL,NULL);

  /* Call a startup from persistence */
  status = APP_ZIGBEE_ZbStartupPersist(zigbee_app_info.zb);
  if(status == ZB_STATUS_SUCCESS)
  {
    /* No fresh startup needed anymore */
    zigbee_app_info.fresh_startup = false;
    APP_DBG("ZbStartupPersist: SUCCESS, restarted from persistence");
    BSP_LED_On(LED_GREEN);
  }
  else
  {
    /* Start-up form persistence failed, perform a fresh ZbStartup */
    APP_DBG("ZbStartupPersist: FAILED to restart from persistence with status: 0x%02x",status);
  }

  if(zigbee_app_info.fresh_startup)
  {
    /* Go for fresh start */
    osThreadFlagsSet(OsTaskNwkFormId,1);
  }

  /* run the task */
  //VST_COMMENT: We have kept the following line commented, so what happens if we reach this point (and we do not form the network)
  //osThreadFlagsSet(OsTaskNwkFormId,1);
}

/**
 * @brief  Configure Zigbee application endpoints
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigEndpoints(void)
{
  struct ZbApsmeAddEndpointReqT req;
  struct ZbApsmeAddEndpointConfT conf;

  memset(&req, 0, sizeof(req));

  /* Endpoint: SW1_ENDPOINT */
  req.profileId = ZCL_PROFILE_ZLL;
  req.deviceId = ZCL_DEVICE_ONOFF_SWITCH;
  req.endpoint = SW1_ENDPOINT;
  ZbZclAddEndpoint(zigbee_app_info.zb, &req, &conf);
  assert(conf.status == ZB_STATUS_SUCCESS);
  /* Light bulb clusters */
  APP_ZIGBEE_LightBulb_ConfigEndpoints();

