gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
#ifdef OTA_SUPPORT
  /* OTA client */
  APP_ZIGBEE_OTA_ConfigEndpoints();
#endif

  /* USER CODE BEGIN CONFIG_ENDPOINT */
  /* USER CODE END CONFIG_ENDPOINT */
}

/**
 * @brief  Handle Zigbee network forming and joining task for FreeRTOS
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessNwkForm(void *argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    APP_ZIGBEE_NwkForm();
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkForm(void)
{
  //VST_COMMENT: maybe the startup control flow chart could be described somewhere
  if ((zigbee_app_info.join_status != ZB_STATUS_SUCCESS) && (HAL_GetTick() >= zigbee_app_info.join_delay))
  {
    struct ZbStartupT config;
    enum ZbStatusCodeT status;

    /* Configure Zigbee Logging */
    //VST_COMMENT: is the increased verbosity level required for debug or for demo?
    ZbSetLogging(zigbee_app_info.zb, ZB_LOG_MASK_LEVEL_ALL, NULL);

    /* Attempt to join a zigbee network */
    ZbStartupConfigGetProDefaults(&config);

    config.startupControl = zigbee_app_info.startupControl;

    if(config.startupControl == ZbStartTypeTouchlink)
    {
      /* Using the Uncertified Distributed Global Key (d0:d1:d2:d3:d4:d5:d6:d7:d8:d9:da:db:dc:dd:de:df) */
      /* This key can be used as an APS Link Key between Touchlink devices.*/
      memcpy(config.security.distributedGlobalKey, sec_key_distrib_uncert, ZB_SEC_KEYSIZE);

      /* Use the Touchlink Certification Key (c0:c1:c2:c3:c4:c5:c6:c7:c8:c9:ca:cb:cc:cd:ce:cf).
      * This key is "mashed" with the Touchlink session data to generate the Network Key */
      ZbBdbSet(zigbee_app_info.zb, ZB_BDB_TLKey, sec_key_touchlink_cert, ZB_SEC_KEYSIZE);

      /* Set the "Key Encryption Algorithm" to Certification */
      enum ZbBdbTouchlinkKeyIndexT keyIdx = TOUCHLINK_KEY_INDEX_CERTIFICATION;
      ZbBdbSet(zigbee_app_info.zb, ZB_BDB_TLKeyIndex, &keyIdx, sizeof(keyIdx));

      int8_t val8 = APP_TOUCHLINK_MIN_RSSI;
      ZbBdbSet(zigbee_app_info.zb, ZB_BDB_TLRssiMin, &val8, sizeof(val8));

      /* Set the centralized network */
      APP_DBG("Network config : APP_STARTUP_CENTRALIZED_COORDINATOR");
      /* Configure the startup to use Touchlink */
      config.bdbCommissioningMode |= BDB_COMMISSION_MODE_TOUCHLINK;
      config.touchlink.tl_endpoint = APP_ZIGBEE_TOUCHLINK_ENDPOINT;
      config.touchlink.bind_endpoint = SW1_ENDPOINT;
#if (APP_ZIGBEE_TOUCHLINK_TARGET == 1)
      config.touchlink.flags = ZCL_TL_FLAGS_IS_TARGET; /* Just comment out this line to switch to Initiator mode*/
#endif
      config.touchlink.zb_info = ZCL_TL_ZBINFO_TYPE_ROUTER;
      config.touchlink.zb_info |= ZCL_TL_ZBINFO_RX_ON_IDLE;
      config.touchlink.deviceId = ZCL_DEVICE_ONOFF_LIGHT;

      /* Touchlink uses the BDB Primary and Secondary channel masks, which we leave as defaults. */
      /* Touchlink primary channels are:  11, 15, 20, and 25. All other channels constitute the secondary ZLL channels */
      config.channelList.count = 1;
      config.channelList.list[0].page = 0;
      config.channelList.list[0].channelMask = APP_ZIGBEE_TOUCHLINK_CHANNEL_MASK; /*Channels in use */
    }
    else if(config.startupControl == ZbStartTypeJoin)
    {
      APP_DBG("Network config : APP_STARTUP_CENTRALIZED_ROUTER");

      /* Using the default HA preconfigured Link Key */
      memcpy(config.security.preconfiguredLinkKey, sec_key_ha,ZB_SEC_KEYSIZE);
      config.channelList.count = 1;
      config.channelList.list[0].page = 0;
      config.channelList.list[0].channelMask = WPAN_CHANNELMASK_2400MHZ;
    }
    else {
      /* We should never get here */
      APP_DBG("ERROR : Network config not set !!!");
      return;
    }
    /* Using ZbStartupWait (blocking) */
    status = ZbStartupWait(zigbee_app_info.zb, &config);

    APP_DBG("ZbStartup Callback (status = 0x%02x)", status);
    zigbee_app_info.join_status = status;

    if (status == ZB_STATUS_SUCCESS)
    {
      zigbee_app_info.join_delay = 0U;
      zigbee_app_info.init_after_join = true;
      APP_DBG("Startup done !\n");
      /* USER CODE BEGIN 3 */
       BSP_LED_On(LED_BLUE);
#ifdef OTA_SUPPORT
      /* Prepare for OTA */
      APP_ZIGBEE_OTA_Client_Init();
#endif
      /* Register Persistent data change notification */
      ZbPersistNotifyRegister(zigbee_app_info.zb,APP_ZIGBEE_persist_notify_cb,NULL);
      /* Call the callback once here to save persistence data */
      APP_ZIGBEE_persist_notify_cb(zigbee_app_info.zb,NULL);
      /* USER CODE END 3 */
    }
    else
    {
      APP_DBG("Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY);
      zigbee_app_info.join_delay = HAL_GetTick() + APP_ZIGBEE_STARTUP_FAIL_DELAY;
      /* USER CODE BEGIN 4 */
            zigbee_app_info.join_retry_counter++;
      /* USER CODE END 4 */
    }
  }

  /* If Network forming/joining was not successful reschedule the current task to retry the process */
  if (zigbee_app_info.join_status != ZB_STATUS_SUCCESS)
  {
    if( zigbee_app_info.join_retry_counter < APP_ZIGBEE_NETWORK_JOIN_MAX_RETRY)
    {
      osThreadFlagsSet(OsTaskNwkFormId,1);
    }
    else
    {
      APP_DBG("Startup fail reached max permissible retries:  %d!\n",zigbee_app_info.join_retry_counter);
      /* Reset join retry counter */
      zigbee_app_info.join_retry_counter=0;
      return;
    }
  }
  /* USER CODE BEGIN NW_FORM */
  else
  {
    zigbee_app_info.init_after_join = false;

    /* Assign ourselves to the group addresses */
    APP_ZIGBEE_ConfigGroupAddr();

    /* Since we're using group addressing (broadcast), shorten the broadcast timeout */
    uint32_t bcast_timeout = 3;
    ZbNwkSet(zigbee_app_info.zb, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &bcast_timeout, sizeof(bcast_timeout));
  }
  /* USER CODE END NW_FORM */
}

/*************************************************************
 * ZbStartupWait Blocking Call
 *************************************************************/
struct ZbStartupWaitInfo
{
  bool active;
  enum ZbStatusCodeT status;
};

static void ZbStartupWaitCb(enum ZbStatusCodeT status, void *cb_arg)
{
  struct ZbStartupWaitInfo *info = cb_arg;

