gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
  Receive_Notification_From_M0();
}

/**
 * @brief  This function is called before sending any zigbee command to the M0
 *         core.
 * @param  None
 * @retval None
 */
void Pre_ZigbeeCmdProcessing(void)
{
  osMutexAcquire(MtxZigbeeId, osWaitForever);
}

/**
 * @brief  This function is called just after having received the result associated to the command
 *         send to the M0
 * @param  None
 * @retval None
 */
void Post_ZigbeeCmdProcessing(void)
{
  osMutexRelease(MtxZigbeeId);
}
/**
 * @brief  This function waits for getting an acknowledgment from the M0.
 *
 * @param  None
 * @retval None
 */
static void Wait_Getting_Ack_From_M0(void)
{
  osSemaphoreAcquire(TransferToM0Semaphore, osWaitForever);
}

/**
 * @brief  Receive an acknowledgment from the M0+ core.
 *         Each command send by the M4 to the M0 are acknowledged.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Ack_From_M0(void)
{
  osSemaphoreRelease(TransferToM0Semaphore);
}

/**
 * @brief  Receive a notification from the M0+ through the IPCC.
 *         This function is called under interrupt.
 * @param  None
 * @retval None
 */
static void Receive_Notification_From_M0(void)
{
  CptReceiveNotifyFromM0++;
  osThreadFlagsSet(OsTaskNotifyM0ToM4Id,1);
}

/**
 * @brief  This function is called when a request from M0+ is received.
 *
 * @param   Notbuffer : a pointer to TL_EvtPacket_t
 * @return  None
 */
void TL_ZIGBEE_M0RequestReceived(TL_EvtPacket_t *Reqbuffer)
{
  p_ZIGBEE_request_M0_to_M4 = Reqbuffer;

  CptReceiveRequestFromM0++;
  osThreadFlagsSet(OsTaskRequestM0ToM4Id,1);
}

/**
 * @brief Perform initialization of TL for Zigbee.
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_TL_INIT(void)
{
  ZigbeeConfigBuffer.p_ZigbeeOtCmdRspBuffer = (uint8_t *)&ZigbeeOtCmdBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotAckBuffer = (uint8_t *)ZigbeeNotifRspEvtBuffer;
  ZigbeeConfigBuffer.p_ZigbeeNotifRequestBuffer = (uint8_t *)ZigbeeNotifRequestBuffer;
  TL_ZIGBEE_Init(&ZigbeeConfigBuffer);
}

/**
 * @brief Process the messages coming from the M0.
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessNotifyM0ToM4(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    if (CptReceiveNotifyFromM0 != 0)
    {
      /* Reset counter */
      CptReceiveNotifyFromM0 = 0;
      Zigbee_CallBackProcessing();
    }
  }
}

/**
 * @brief Process the requests coming from the M0.
 * @param None
 * @return None
 */
static void APP_ZIGBEE_ProcessRequestM0ToM4(void * argument)
{
  UNUSED(argument);

  for(;;)
  {
    osThreadFlagsWait(1,osFlagsWaitAll,osWaitForever);
    if (CptReceiveRequestFromM0 != 0)
    {
      CptReceiveRequestFromM0 = 0;
      Zigbee_M0RequestProcessing();
    }
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief  Set group addressing mode
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigGroupAddr(void)
{
  struct ZbApsmeAddGroupReqT req;
  struct ZbApsmeAddGroupConfT conf;

  memset(&req, 0, sizeof(req));
  req.endpt = SW1_ENDPOINT;
  req.groupAddr = SW1_GROUP_ADDR;
  ZbApsmeAddGroupReq(zigbee_app_info.zb, &req, &conf);

}

void APP_ZIGBEE_LaunchPushButtonTask(uint32_t buttonFlag)
{
  osThreadFlagsSet(OsTaskPushButtonId,buttonFlag);
} /* APP_ZIGBEE_LaunchPushButtonTask */

void APP_ZIGBEE_LaunchPushButton3ShortPressTask(void)
{
	zigbee_app_info.startupControl=ZbStartTypeJoin;
	osThreadFlagsSet(OsTaskNwkFormId, 1);
} /* APP_ZIGBEE_LaunchPushButton3ShortPressTask */

void APP_ZIGBEE_LaunchPushButton3LongPressTask(void)
{
	zigbee_app_info.startupControl=ZbStartTypeTouchlink;
	osThreadFlagsSet(OsTaskNwkFormId, 1);
} /* APP_ZIGBEE_LaunchPushButton3LongPressTask */

/**
 * @brief  Function used to process push of different SW buttons
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ProcessPushButton(void * argument)
{
  UNUSED(argument);
  uint32_t flags=0;
  for(;;)
  {
    uint32_t expected_fags;
    expected_fags = BUTTON_SW1_PIN | BUTTON_SW2_PIN;

    osThreadFlagsWait(expected_fags,osFlagsWaitAny|osFlagsNoClear,osWaitForever);
    flags=osThreadFlagsGet();
    if (flags & BUTTON_SW1_PIN)
    {
      APP_ZIGBEE_SW1_Process();
      osThreadFlagsClear(BUTTON_SW1_PIN);
    }

    if (flags & BUTTON_SW2_PIN)
    {
      APP_ZIGBEE_SW2_Process();
      osThreadFlagsClear(BUTTON_SW2_PIN);
    }
  }
} /* APP_ZIGBEE_ProcessPushButton */

/**
 * @brief  Function used to process push of SW1 button
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW1_Process(void)
{
  APP_DBG("APP_ZIGBEE_SW1_Process.");
} /* APP_ZIGBEE_SW1_Process */

/**
 * @brief  Function used to process push of SW2 button
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_SW2_Process(void)
{
  APP_DBG("APP_ZIGBEE_SW2_Process.");
} /* APP_ZIGBEE_SW2_Process */

/**
 * @brief  notify to save persistent data callback
 * @param  zb: Zigbee device object pointer, cbarg: callback arg pointer
 * @retval None
 */
static void APP_ZIGBEE_persist_notify_cb(struct ZigBeeT *zb, void *cbarg)
{
  APP_DBG("Notification to save persistent data requested from stack");
  /* Save the persistent data */
  APP_ZIGBEE_persist_save();
} /* APP_ZIGBEE_persist_notify_cb */

/**
 * @brief  Save persistent data
 * @param  None
 * @retval true if success , false if fail
 */
static bool APP_ZIGBEE_persist_save(void)
{
  uint32_t len;

  /* Clear the RAM cache before saving */
  memset(cache_persistent_data.U8_data, 0x00, ST_PERSIST_MAX_ALLOC_SZ);

  /* Call the satck API t get current persistent data */
  len = ZbPersistGet(zigbee_app_info.zb, 0, 0);
  /* Check Length range */
  if (len == 0U)
  {
    /* If the persistence length was zero then no data available. */
    APP_DBG("APP_ZIGBEE_persist_save: no persistence data to save !");
    return false;
  }
  if (len > ST_PERSIST_MAX_ALLOC_SZ)
  {
    /* if persistence length to big to store */
    APP_DBG("APP_ZIGBEE_persist_save: persist size too large for storage (%d)", len);
    return false;
  }

  /* Store in cache the persistent data */
  len = ZbPersistGet(zigbee_app_info.zb, &cache_persistent_data.U8_data[ST_PERSIST_FLASH_DATA_OFFSET], len);

  /* Store in cache the persistent data length */
  cache_persistent_data.U32_data[0] = len;

