gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
  zigbee_app_info.persistNumWrites++;
  APP_DBG("APP_ZIGBEE_persist_save: Persistence written in cache RAM (num writes = %d) len=%d",
           zigbee_app_info.persistNumWrites, cache_persistent_data.U32_data[0]);

#ifdef CFG_NVM
  if(!APP_ZIGBEE_NVM_Write())
  {
    return false;
  }
  APP_DBG("APP_ZIGBEE_persist_save: Persistent data FLASHED");
#endif /* CFG_NVM */

  return true;
} /* APP_ZIGBEE_persist_save */

/**
 * @brief  Start Zigbee Network from persistent data
 * @param  zb: Zigbee device object pointer
 * @retval Zigbee stack Status code
 */
static enum ZbStatusCodeT APP_ZIGBEE_ZbStartupPersist(struct ZigBeeT* zb)
{
  bool read_status;
  enum ZbStatusCodeT status = ZB_STATUS_SUCCESS;

  /* Restore persistence */
  read_status = APP_ZIGBEE_persist_load();

  if (read_status)
  {
    /* Make sure the EPID is cleared, before we are allowed to restore persistence */
    uint64_t epid = 0U;
    ZbNwkSet(zb, ZB_NWK_NIB_ID_ExtendedPanId, &epid, sizeof(uint64_t));

    /* Start-up from persistence */
    APP_DBG("APP_ZIGBEE_ZbStartupPersist: restoring stack persistence");
    status = ZbStartupPersist(zb, &cache_persistent_data.U8_data[4], cache_persistent_data.U32_data[0],NULL,APP_ZIGBEE_PersistCompleted_callback,NULL);
  }
  else
  {
    /* Failed to restart from persistence */
    APP_DBG("APP_ZIGBEE_ZbStartupPersist: no persistence data to restore");
    status = ZB_STATUS_ALLOC_FAIL;
  }

  /* Only for debug purpose, depending of persistent data, following traces
  could display bytes that are irrelevants to on off cluster */
  if(status == ZB_STATUS_SUCCESS)
  {
    /* read the last bytes of data where the ZCL on off persistent data shall be*/
    uint32_t len = cache_persistent_data.U32_data[0] + 4 ;
    APP_DBG("ClusterID %02x %02x",cache_persistent_data.U8_data[len-9],cache_persistent_data.U8_data[len-10]);
    APP_DBG("Endpoint %02x %02x",cache_persistent_data.U8_data[len-7],cache_persistent_data.U8_data[len-8]);
    APP_DBG("Direction %02x",cache_persistent_data.U8_data[len-6]);
    APP_DBG("AttrID %02x %02x",cache_persistent_data.U8_data[len-4],cache_persistent_data.U8_data[len-5]);
    APP_DBG("Len %02x %02x",cache_persistent_data.U8_data[len-2],cache_persistent_data.U8_data[len-3]);
    APP_DBG("Value %02x",cache_persistent_data.U8_data[len-1]);
  }

  return status;
} /* APP_ZIGBEE_ZbStartupPersist */

/**
 * @brief  Load persistent data
 * @param  None
 * @retval true if success, false if fail
 */
static bool APP_ZIGBEE_persist_load(void)
{
#ifdef CFG_NVM
  APP_DBG("Retrieving persistent data from FLASH");
  return APP_ZIGBEE_NVM_Read();
#else
  /* Check length range */
  if ((cache_persistent_data.U32_data[0] == 0) ||
      (cache_persistent_data.U32_data[0] > ST_PERSIST_MAX_ALLOC_SZ))
  {
    APP_DBG("No data or too large length : %d",cache_persistent_data.U32_data[0]);
    return false;
  }
  return true;
#endif /* CFG_NVM */
} /* APP_ZIGBEE_persist_load */

/**
 * @brief  timer callback to wait end of restore cluster persistence form M0
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_PersistCompleted_callback(enum ZbStatusCodeT status,void *arg)
{
  if(status == ZB_WPAN_STATUS_SUCCESS)
  {
    APP_DBG("Persist complete callback entered with SUCCESS");
    /* Restore the on/off value based on persitence loaded */
    if(APP_ZIGBEE_RestoreClusterAttr(zigbee_app_info.onOff_server_1)==ZCL_STATUS_SUCCESS)
    {
      APP_DBG("Read back OnOff cluster attribute : SUCCESS");
    }
    else
    {
      APP_DBG("Read back OnOff cluster attribute : FAILED");
    }
  }
  else
  {
    APP_DBG("Error in persist complete callback %x",status);
  }
  /* Register Persistent data change notification */
  ZbPersistNotifyRegister(zigbee_app_info.zb,APP_ZIGBEE_persist_notify_cb,NULL);

  /* Call the callback once here to save persistence data */
  APP_ZIGBEE_persist_notify_cb(zigbee_app_info.zb,NULL);
} /* APP_ZIGBEE_PersistCompleted_callback */


/**
 * @brief  read on off attribute after a startup form persistence
 * @param  clusterPtr: pointer to cluster
 *
 * @retval stack status code
 */
static enum ZclStatusCodeT APP_ZIGBEE_RestoreClusterAttr(struct ZbZclClusterT *clusterPtr)
{
  uint8_t attrVal;

  if (ZbZclAttrRead(clusterPtr, ZCL_ONOFF_ATTR_ONOFF, NULL,
      &attrVal, sizeof(attrVal), false) != ZCL_STATUS_SUCCESS)
  {
    return ZCL_STATUS_FAILURE;
  }
  if (attrVal)
  {
    APP_DBG("RESTORE LED_RED TO ON");
    BSP_LED_On(LED_RED);
  }
  else
  {
    APP_DBG("RESTORE LED_RED TO OFF");
    BSP_LED_Off(LED_RED);
  }

  return ZCL_STATUS_SUCCESS;
} /* APP_ZIGBEE_RestoreClusterAttr */


#ifdef CFG_NVM
/**
 * @brief  Init the NVM
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NVM_Init(void)
{
  int eeprom_init_status;

  APP_DBG("Flash starting address = %x",HW_FLASH_ADDRESS  + CFG_NVM_BASE_ADDRESS);
  eeprom_init_status = EE_Init( 0 , HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS );

  if(eeprom_init_status != EE_OK)
  {
    /* format NVM since init failed */
    eeprom_init_status= EE_Init( 1, HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS );
  }
  APP_DBG("EE_init status = %d",eeprom_init_status);

} /* APP_ZIGBEE_NVM_Init */

/**
*@brief  Read the persistent data from NVM
* @param  None
* @retval true if success , false if failed
*/
static bool APP_ZIGBEE_NVM_Read(void)
{
  uint16_t num_words = 0;
  bool status = true;
  int ee_status = 0;
  HAL_FLASH_Unlock();
  __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_EOP | FLASH_FLAG_PGSERR | FLASH_FLAG_WRPERR | FLASH_FLAG_OPTVERR);

  /* Read the data length from cache */
  ee_status = EE_Read(0, ZIGBEE_DB_START_ADDR, &cache_persistent_data.U32_data[0]);
  if (ee_status != EE_OK)
  {
    APP_DBG("Read -> persistent data length not found ERASE to be done - Read Stopped");
    status = false;
  }
  /* Check length is not too big nor zero */
  else if((cache_persistent_data.U32_data[0] == 0) ||
          (cache_persistent_data.U32_data[0]> ST_PERSIST_MAX_ALLOC_SZ))
  {
    APP_DBG("No data or too large length : %d", cache_persistent_data.U32_data[0]);
    status = false;
  }
  /* Length is within range */
  else
  {
    /* Adjust the length to be U32 aligned */
    num_words = (uint16_t) (cache_persistent_data.U32_data[0]/4) ;
    if (cache_persistent_data.U32_data[0] % 4 != 0)
    {
      num_words++;
    }

