gooberx/Zigbee_demo_workshop_final/STM32_WPAN/App/app_zigbee.c
    /* copy the read data from Flash to cache including length */
    for (uint16_t local_length = 1; local_length <= num_words; local_length++)
    {
      /* read data from first data in U32 unit */
      ee_status = EE_Read(0, local_length + ZIGBEE_DB_START_ADDR, &cache_persistent_data.U32_data[local_length] );
      if (ee_status != EE_OK)
      {
        APP_DBG("Read not found leaving");
        status = false;
        break;
      }
    }
  }

  HAL_FLASH_Lock();
  if(status)
  {
    APP_DBG("READ PERSISTENT DATA LEN = %d",cache_persistent_data.U32_data[0]);
  }
  return status;
} /* APP_ZIGBEE_NVM_Read */

/**
 * @brief  Write the persistent data in NVM
 * @param  None
 * @retval None
 */
static bool APP_ZIGBEE_NVM_Write(void)
{
  int ee_status = 0;

  uint16_t num_words;
  uint16_t local_current_size;

  num_words = 1U; /* 1 words for the length */
  num_words+= (uint16_t) (cache_persistent_data.U32_data[0]/4);

  /* Adjust the length to be U32 aligned */
  if (cache_persistent_data.U32_data[0] % 4 != 0)
  {
    num_words++;
  }

  /* Save data to flash */
  for (local_current_size = 0; local_current_size < num_words; local_current_size++)
  {
    ee_status = EE_Write(0, (uint16_t)local_current_size + ZIGBEE_DB_START_ADDR, cache_persistent_data.U32_data[local_current_size]);
    if (ee_status != EE_OK)
    {
      if(ee_status == EE_CLEAN_NEEDED) /* Shall not be there if CFG_EE_AUTO_CLEAN = 1*/
      {
        APP_DBG("CLEAN NEEDED, CLEANING");
        EE_Clean(0,0);
      }
      else
      {
        /* Failed to write, an Erase shall be done */
        APP_DBG("APP_ZIGBEE_NVM_Write failed @ %d status %d", local_current_size,ee_status);
        break;
      }
    }
  }

  if(ee_status != EE_OK)
  {
    APP_DBG("WRITE STOPPED, need a FLASH ERASE");
    return false;
  }

  APP_DBG("WRITTEN PERSISTENT DATA LEN = %d",cache_persistent_data.U32_data[0]);
  return true;

} /* APP_ZIGBEE_NVM_Write */

/**
 * @brief  Erase the NVM
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NVM_Erase(void)
{
  EE_Init(1, HW_FLASH_ADDRESS + CFG_NVM_BASE_ADDRESS); /* Erase Flash */
} /* APP_ZIGBEE_NVM_Erase */

#endif /* CFG_NVM */

/* USER CODE END FD_LOCAL_FUNCTIONS */
